#### YZJustificationOption Enumeration

---

|  |
| --- |
| See Also |

The option for whether a framing element has independent or uniform justification on its ends.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum YZJustificationOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration YZJustificationOption ``` |

| Visual C++ |
| --- |
| ``` public enum class YZJustificationOption ``` |

# Members

| Member name | Description |
| --- | --- |
| Uniform | Uniform justification settings applied to the element ends. |
| Independent | Independent justification settings applied to the element ends. |

# See Also

Autodesk.Revit.DB.Structure Namespace